export default {
  GAME_PARTS: ["نام", "نام خانوادگی", "غذا", "حیوان", "اشیاء"],
  ITEM_DESCRIPTION: "شروع با حرف",
  SERVER: "http://localhost:3000",
  STOP_BUTTON_TEXT: "استُپ",
  COMPLAIN_BUTTON_TEXT: "ارسال نظر",
  START_GAME_LINK_TEXT: "شروع بازی !",
  connecting_msg: "در حال اتصال به سرور",
  legend: {
    valid: "فعلا قابل قبوله",
    invalid: "قابل قبول نیست",
    duplicate: "تکراریه یا بهش اعتراض شده"
  },
  modal: {
    nok: {
      header: "نمی شه!",
      text:
        "فقط وقتی می تونی بگی استُپ جواب همه سوالا رو درست نوشته باشی. از رنگ کارت ها می تونی وضعیت اولیه جواب هاتو بفهمی."
    },
    uns: {
      header: "استُپ نا موفق!",
      text:
        "همه ی بازیکنای دیگه به یکی یا چند تا از جوابات اعتراض کردن برای همین نمی تونیم اون جواب هارو ازت قبول کنیم و به خاطر همین بازی هنوز ادامه داره! پس هر چه سریع تر جواباتو بررسی کن تا از بقیه جا نمونی!! برای بررسی جواب هات کافیه یک بار روی کارتات کلیک کنی!"
    },
    sto: {
      header: "استُپ!",
      text:
        "خبر استُپت به گوش همه بازیکنا رسیده. حالا دارن جواب هایی که دادی رو بررسی می کنن! حواستو جمع کن اگه همه بازیکنا به یکی از جوابات اعتراض کنن، اون جواب غیرقابل قبول می شه و بازی ادامه پیدا می کنه! پس این پیام رو ببند و گوش به زنگ باش! شاید به همین زودیا خبر پیروزیتو برات آوردیم..."
    },
    res: {
      header: "اعتراض موفق! بازی ادامه داره...",
      text:
        "مثل اینکه اعتراضت جواب داده و بازی هنوز ادامه داره! بدو تا از بقیه جا نموندی..."
    },
    los: {
      header: "دفعه دیگه شما برنده بشی",
      text:
        "خب متاسفانه بازی تموم شد و نشد که این دفعه شما برنده بشی :( @  هم برنده بازی شد!"
    },
    win: {
      header: "تبریک",
      text:
        "تبریک می گم. تونستی با دقت و سرعت عمل عالیت بین همه بازیکنا برنده ی بازی بشی!"
    },
    spd: {
      header: "استُپ!",
      text:
        "یکی از بازیکنا استُپ کرده! جوابایی که داده رو آوردیم تا بررسی کنی. اگه به موردی اعتراض داشتی روی نصفه ی سمت چپ کارت کلیک کن یا اگه جوابش درسته روی نصفه ی سمت راست. البته اگه دکمه ارسال رو بزنی اون کارت هایی که بهشون اعتراض نکردی سبز می شن. دقت کن که اگه همه بازیکنا به جوابی اعتراض کنن، اون وقت جواب غیرقابل قبول می شه و بازی ادامه پیدا می کنه. در غیر این صورت بازی تموم می شه و برنده هم کسیه که استُپ کرده! پس خوب حواستو جمع کن اگه جوابی مشکوکه اعتراض کنی."
    },
    com: {
      header: "اعتراضتو به گوش داور رسوندیم!",
      text:
        "اعتراضت برای داور بازی فرستاده شد. حالا باید صبر کنی بقیه هم نطرشون رو بگن. اگه همه ی بازیکنا به یکی از جوابا اعتراض کنن، اون جواب غیرقابل قبول می شه و بازی ادامه پیدا می کنه! پس این پیامو ببند و گوش به زنگ باش تا نتیجه اعتراض ها رو بهت برسونیم."
    }
  }
};
